[![londonr-banner-logo](londonr-banner.png)](https://www.londonr.org/)

<div style = "text-align: right"><font size = 3 color = "#B22222" face = "verdana"><b>- LondonR - Python for R Users - </b></font></div>
<div style = "text-align: right"><font><i>By 'Dayo Oguntoyinbo</i></font></div>
<div style = "text-align: right"><font>16th December 2019</font></div>

# Part C - Data Import and Data Manipulation

In [1]:
# Options for all cells 
import pandas as pd
# change display setting of pandas
# needed for nbconversion
# pd.set_option('display.notebook_repr_html', False)
# Setting the graphics
%matplotlib inline
# suppress all warnings (since anova gives a warning)
import warnings
warnings.filterwarnings("ignore")

## Data Import

The **pandas** package provides lots of simple functions for reading data from and writing data to various different file formats, such as CSV, Excel, SQL, JSON, and HTML. All the read functions in the package (`pd.read_*` functions) create a **pandas** `DataFrame` object. This object, like a `data.frame` in R, is meant for storing tabular data where columns can potentially contain different data types. The dimension of a data frame are typically labelled with row names and column names in R. Here, the labels are called index and columns, respectively.

In [2]:
import pandas as pd
tips = pd.read_csv("data/tips.csv")

**Tip**

In Python, only the equals sign `=` is used to assign values to variables. Variable names can start with an underscore `_` (unlike in R) and are case sensitive (like in R).

**Tip**

Documentation for each function can be accessed via the websites for the package in question, e.g., [http://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html), or can be viewed directly from Jupyter notebooks via `?`. It can be placed in front of the function call as in R, e.g., `?pd.read_csv`, or after it.

## Functions, Methods and Attributes

R has been characterised well by "Everything that exists is an object. Everything that happens is a function call." The Python equivalent is "Everything is an object, and all objects can have attributes."

When working in R, in most cases we use a function on an object, i.e., `function(object, ...)`. This is the case for functions from a package, e.g., to read in data, generic functions like `summary` which do different things depending on the object class, or functions to access attributes of the object such as the dimension (via the `dim` function).

In Python, functions from a package such as `pd.read_csv` are utilised like in R, i.e., `function(arguments)`. Beyond that, objects typically have attributes which are references to other Python objects. Those can be data types such as a list to store the dimension of a data frame but also can be functions specific to that object class. Such functions are referred to as object methods, or simply methods.

Attributes, including methods, are accessed via the dot operator `.`.

`<object_name>.<attribute>`

For example, attributes of a **pandas** `DataFrame` include the dimension (`.shape`) and the dimension labels (`.index` and `.columns`).

In [3]:
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

Methods require parentheses after the method name, where any argument can be specified.

`<object_name>.<method>(arg=*)`

Methods for a `DataFrame` include the `.head` and `.tail` functions for preview the first or last few rows of the data frame as well the `.describe` function which provides a summary of the data frame, similar to R's `summary` function.

In [4]:
tips.describe(include="all")

        total_bill         tip   sex smoker  day    time        size
count   244.000000  244.000000   244    244  244     244  244.000000
unique         NaN         NaN     2      2    4       2         NaN
top            NaN         NaN  Male     No  Sat  Dinner         NaN
freq           NaN         NaN   157    151   87     176         NaN
mean     19.785943    2.998279   NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638   NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000   NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000   NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000   NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500   NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000   NaN    NaN  NaN     NaN    6.000000

**Tip**

In Jupyter, we can view all the attributes and methods associated with an object by using tab completion. Once an object has been created (i.e., tips for above), typing `tips.` into a cell and pressing the tab key shows all the attributes and methods that can be used on that object.

**Exercise**

1. Import the mtcars data (mtcars.csv), ensuring that the car names are used for the row index.
2. What are the dimensions of the imported data?
3. Print the top 5 rows of the data.

_Extension_
4. Print the first and last 5 rows of the data.
5. Import only the miles per gallon (mpg) and weight (wt) columns from the mtcars data
6. Print 10 randomly selected rows of the data (use `set.seed(123)`).

In [5]:
# Solution
import pandas as pd
mtcars = pd.read_csv("data/mtcars.csv", index_col=0)

In [6]:
mtcars.shape

(32, 11)

In [7]:
mtcars.head(5)

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [8]:
mtcars.head(5).append(mtcars.tail(5))

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2

In [9]:
mtcars2 = pd.read_csv("data/mtcars.csv", index_col=0, usecols=[0, 1, 6])
mtcars2.head()

                    mpg     wt
Mazda RX4          21.0  2.620
Mazda RX4 Wag      21.0  2.875
Datsun 710         22.8  2.320
Hornet 4 Drive     21.4  3.215
Hornet Sportabout  18.7  3.440

# Data Manipulation

The **pandas** package can be used for more than importing and exporting data. Written originally by Wes McKinney, the **pandas** package has grown to also include data manipulation, statistics and visualisation. Here, we will focus on the functionality for data manipulation.

Common data manipulation tasks mostly have corresponding `DataFrame` methods:

| Description | Method | 
| --- | --- | 
| Filter rows based on values | `.loc` | 
| Filter rows based on index | `.iloc` | 
| Filter rows based on values (alternative) | `.query` | 
| Sort rows | `.sort_values` | 
| Rename columns | `.rename` | 
| Summarise/Aggregate columns | `.agg` |
| Group the data | `.groupby` | 
| Append the data | `.append` | 

However, some tasks such as selecting columns, changing or adding new columns, or selecting rows based on position are not done via a corresponding method. We will show how this is done in Python and introduce the concept of dictionaries which are needed for setting arguments to the `.rename` and `.agg` methods.

## Selecting Columns

We can access columns in a data frame by indexing with `[]` and supplying the corresponding column labels. To access a single column, a string with the column label is sufficient.

In [10]:
tips['time'].head()

0    Dinner
1    Dinner
2    Dinner
3    Dinner
4    Dinner
Name: time, dtype: object

To access multiple columns, we provide the labels in form of a list. Lists are created using square brackets `[]`, with individual items separated by commas.

In [11]:
list_of_names = ['total_bill', 'size', 'day']
tips[list_of_names].head()

   total_bill  size  day
0       16.99     2  Sun
1       10.34     3  Sun
2       21.01     3  Sun
3       23.68     2  Sun
4       24.59     4  Sun

**Tip**

Lists in Python, like lists in R, are very versatile and can hold any collection of objects with mixing of multiple types allowed. They are often used to specify a collection of elements for use in function argument. In R, we typically would do that via vectors or lists.

### Series Objects

Selecting multiple columns returns another data frame but selecting a single column returns a `Series` object. This object consists of two parts, `values` and `index`, which can be accessed through the corresponding attributes. A `Series` has similar methods as a `DataFrame`, such as `.head` and `.describe`. Other helpful methods include

* `.isnull()`/`.notnull()` to perform a boolean test for missing/non-missing values
* `.isfinite()` to perform a boolean test for finite values
* `.value_counts()` to return counts of unique values
* `.idxmax()` to return the index of the row with the largest value

**Warning**

Operations such as `+` on two `Series` objects are done based on the index, i.e., matching up elements with the same index, regardless of their position in the series. For comparison, addition of two vectors in R (which do not have an index), is carried out element-wise where the matching up is done by position, i.e, the two first elements are added up, the two second elements are added up, etc.

## Adding and Editing Columns

To add a new column to a `DataFrame`, we select a new column via the indexing method (`[]` as above), using the new column name for which column is to be selected, and assign the new values to it. To edit a column, we can overwrite it and assign new values to the column in the same way.

For example, we can add the tip share to the tips dataset by dividing the tip amount by the total amount of the bill and assign the result to a new column called `tip_share`.

In [12]:
tips['tip_share'] = tips['tip'] / tips['total_bill']
tips.head()

   total_bill   tip     sex smoker  day    time  size  tip_share
0       16.99  1.01  Female     No  Sun  Dinner     2   0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3   0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3   0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2   0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4   0.146808

## Selecting Rows

To select rows based on values in specific columns, we can use `.loc`, `.iloc` or `.query` method which takes logical statements to describe the rows which are to be selected. Unlike in for the `subset` and `filter` functions in R (from base R and the **dplyr** package, respectively), the logical statement for the `.query` provided in one string.

In [13]:
tips_2 = tips.loc[(tips["time"] == 'Dinner') & (tips["day"] != 'Sun') | (tips["size"] > 4)]
tips_2.head()

    total_bill   tip     sex smoker  day    time  size  tip_share
19       20.65  3.35    Male     No  Sat  Dinner     3   0.162228
20       17.92  4.08    Male     No  Sat  Dinner     2   0.227679
21       20.29  2.75  Female     No  Sat  Dinner     2   0.135535
22       15.77  2.23  Female     No  Sat  Dinner     2   0.141408
23       39.42  7.58    Male     No  Sat  Dinner     4   0.192288

In [14]:
tips_2 = tips.query("(time == 'Dinner' & day != 'Sun') | size > 4")
tips_2.head()

    total_bill   tip     sex smoker  day    time  size  tip_share
19       20.65  3.35    Male     No  Sat  Dinner     3   0.162228
20       17.92  4.08    Male     No  Sat  Dinner     2   0.227679
21       20.29  2.75  Female     No  Sat  Dinner     2   0.135535
22       15.77  2.23  Female     No  Sat  Dinner     2   0.141408
23       39.42  7.58    Male     No  Sat  Dinner     4   0.192288

### Slicing Notation

To select rows based on their position, we can also use indexing via `[]` but instead of a string or list to select columns, we use numeric arguments to select rows. The basic concept of this so-called slicing notation is `object[start:stop:step]`. If we wanted to view the first 10 variables at even locations we would use `object[0:20:2]`. This works for selecting sections of lists, strings and rows within data frames. The value of start is inclusive, the value for stop is not, i.e., everything up until but not including `stop` will be selected. If the value of start, stop or step is left empty, then the default values will be taken, which are that start and stop are the first and last values in the object, and step is by default 1.

In [15]:
# Slicing a list
my_list = [12, 45, 74, 12, 97, 62, 53, 78]
my_list[1::2]

[45, 12, 62, 78]

In [16]:
# Slicing a DataFrame for the 1st row
tips[:1:]

   total_bill   tip     sex smoker  day    time  size  tip_share
0       16.99  1.01  Female     No  Sun  Dinner     2   0.059447

In [17]:
# Slicing a DataFrame to view 1 every 50 rows
tips[::50]

     total_bill   tip     sex smoker   day    time  size  tip_share
0         16.99  1.01  Female     No   Sun  Dinner     2   0.059447
50        12.54  2.50    Male     No   Sun  Dinner     2   0.199362
100       11.35  2.50  Female    Yes   Fri  Dinner     2   0.220264
150       14.07  2.50    Male     No   Sun  Dinner     2   0.177683
200       18.71  4.00    Male    Yes  Thur   Lunch     3   0.213789

**Warning**

While indexing in R starts at 1, it starts at 0 in Python. For example, use index `2` to select the third element.

**Exercise**

1. Create a subset of the mtcars data which includes cars that have a weight larger than 3 or four cylinders. How many cars are in that dataset?
2. Slice the mtcars dataset to show the first 10 even rows, i.e., the second, fourth, etc row.
3. Add a new variable which contains the ratio of horse power to weight.

Extension

4. Read in the tips dataset (tips.csv).
5. Calculate the mean tip for for each day.
6. Add a new variable which contains the party size as a binary factor (choose your own cutoff). Hint: The `pd.cut` function works similarly to R's `cut` function.
7. Ensure that the two categories are "small/medium" (four or fewer people) and "large" (more than four people) and labeled appropriately.

In [18]:
# solution
mtcars.query("wt > 3 | cyl == 4").shape
mtcars[1:20:2]
mtcars["hp2wt"] = mtcars["hp"] / mtcars["wt"]

tips = pd.read_csv("Data/tips.csv")
import numpy as np
tips.groupby("day").agg({"tip" : np.mean})
tips["size_f"] = pd.cut(tips["size"], bins=2)
bins_size = pd.IntervalIndex.from_breaks([0,4,7])
tips["size_f"] = pd.cut(tips["size"], bins_size).cat.rename_categories(["small/medium", "large"])
tips.head()

   total_bill   tip     sex smoker  day    time  size        size_f
0       16.99  1.01  Female     No  Sun  Dinner     2  small/medium
1       10.34  1.66    Male     No  Sun  Dinner     3  small/medium
2       21.01  3.50    Male     No  Sun  Dinner     3  small/medium
3       23.68  3.31    Male     No  Sun  Dinner     2  small/medium
4       24.59  3.61  Female     No  Sun  Dinner     4  small/medium

## Dictionaries

Dictionaries are objects which hold an unordered collection of key-value pairs. They are defined with curly braces using the following notation: `{key : value}`, with different key-value pairs being separated with commas.

This can be used to define pairs of old and new names for the `.rename` method.

In [19]:
tips_2 = tips.rename(columns = {"time" : "time_of_day", "size" : "party_size"})
tips_2.head()

   total_bill   tip     sex smoker  day time_of_day  party_size        size_f
0       16.99  1.01  Female     No  Sun      Dinner           2  small/medium
1       10.34  1.66    Male     No  Sun      Dinner           3  small/medium
2       21.01  3.50    Male     No  Sun      Dinner           3  small/medium
3       23.68  3.31    Male     No  Sun      Dinner           2  small/medium
4       24.59  3.61  Female     No  Sun      Dinner           4  small/medium

Dictionaries are also used to specify which columns should be summarised or aggregated in which way, using the `.agg` method. Dictionaries can also hold lists as values, allowing us to specify several summary functions for a column.

Some fundamental summary functions such as `min` and `max` are provided by base Python. More statistical summary functions such as `mean` and `median` are provided by the **NumPy** package.

In [20]:
import numpy as np
tips.agg({"size" : min, "tip" : [min, max, np.mean]})

      size        tip
max    NaN  10.000000
mean   NaN   2.998279
min    1.0   1.000000

**Tip**

In R, the `%>%` operator from the **magrittr** package allows us to make pipelines of a series of steps on an object, e.g., a data frame. In Python, the `.` can be used to chain multiple methods on an object together into one line of code, without having to reassign each time.

## Working with Different Data Types

A `Series` in a `DataFrame` can hold different types of data such as numeric data, categorical data, datetimes, etc. For most common data types other than numeric, we need so-called accessors to access the type-specific attributes and methods. For example, the accessor for categorical data is `.cat` and the methods include `.cat.rename_categories()`, `.cat.remove_unused_categories()`, and `.cat.reorder_categories()`.

**Warning**

It is, of course, possible to access the categorical data via `.values` and manipulate this directly. However, the resulting object is an array, not a `Series`.

[![Creative Commons License](http://i.creativecommons.org/l/by-nc-nd/3.0/88x31.png)](http://creativecommons.org/licenses/by-nc-nd/3.0/)